# Про вдовиного сина Матусю, що став царем       МАМУСЯ
def input_number(message):
    while True:
        number = input(message).strip()
        if number.isdigit():
            break
    return int(number)


def input_options(message, options):
    question = f"{message} ({', '.join(options)}): "
    while True:
        option = input(question).strip().lower()
        if option in options:
            break
    return option


name = input("Жила собі вдова. Мала вона одного сина. Ніяк він її не кликав, лише:- ")
казка = input_options(
    (
        f"Навіть, як говорив позаочі, то так і казав: «Моя-{name}»  Бідна {name} — бідний і син.\n"
        "А бідного ніхто за людину не мав. Через це з \nхлопчини всі насміхалися, не мав, бідака,\n"
        "ні куди вийти, ні до кого прийти. Скоро ліг — рано встав, отак роки бігли.? "
    ),
    {"так", "ні"},
)

if казка == "так":
    print(
        f"Одного разу каже {name} :— Знасш що, сину , піду ти у світи.\n "
        f"Десь, може, люди будуть мати тебе за людину...\nКожній {name}  жаль \nза сином,"
        f" коли покидає рідну хату, але що робити?— Йди,— каже {name}. )"
    )
    pep = input_options(
        " Він зібрався і пішов шукати служби. Йшов не день і не два. БАЧИТЬ",
        {"ліси", "дуби", "пір'я"},
    )
    if pep == "ліси":
        print(
            " що вже не знає, як із них вийти. Не встиг роздивитися як слід,\n а хмари "
            "вкрили небо, почорніло в лісі — мав\n бути такий дощ, що ну..."
        )
    elif pep == "дуби":
        print(
            " Стає він під височезного дуба. А то не дощ, а почало градом бити."
            " Щось там, на дубі,\n так тяжко пищить, що він не годен\n витримати: "
            "лізе живенько на дуба."
        )
    else:
        print(" пір'я")

        number = input(
            " Там таке величезне гніздо, що міг би сховатися під нього,\n а в гнізді "
            "великі 5 пташенят, але які ще навіть \nу пір'я не вбралися.:"
        )
        number = input_number(" введіть яку к-сть пташеняток згадується?:")

        if number == 5:
            print(
                "\n   Скидає, він з себе кожух, накриває  5 пташенят, а сам над гніздом нахилився. "
                f"{str(number)} - ти пташеняток поки град не перестав іти. Так його змолотило,"
                " що ледве живий.\n Він — кожух на себе, зліз із дерева, \nале куди "
                "йти — не знає.!!!"
            )
        else:
            print(
                "\nРаптом прилітає величезний птах.Так плаче, як людина:!!!"
                f"{str(number)} не так мало статися..."
            )
elif казка == "ні":
    print(
        f" Бери мене на руки та й неси, каже {name} Ти будеш мені за ноги, а я тобі — за очі. "
        " Будемо \nтобі кращої долі в світі \nшукати"
    )

print(
    "ДОВГО  вони мандрували, аж до того лісу, де великий птах \nгніздо має. Прийшли під дуба, "
    f"\nі cин почав розповідати птахові про свої пригоди з матусею {name}, "
    "Птах вислухав \nйого і каже:— Йдіть туди і туди, під\n тим і тим деревом "
    "є дві кринички: з цілющою \nі живлющою водою."
)
print(
    f"Промий водою з першої криниці свої обрубки, а ти — очі,а з другої криниці напийтеся води. "
    "І життя твоє буде щасливим!!!! Кінець"
)
