while True:

    pitsa = input("Доброго дня, бажаєте замовити піццу Зроби Сам? (2 / 1) порції? ")

    if pitsa == "2":
        print("що конкретно зі складників бажаєте додати ? )")
        laptop = input(" Для великої сімї найкраще смакує  (сирна, салямі, панчетта)")
        if laptop == "сирна":
            print(" сир, помідори, cметана")
        elif laptop == "салямі":
            print(" Салямі, cир, помідори, часник")
        else:
            print("має розмір 20*60 см сир, помідори, cметана салямі, cир, часник")

    elif pitsa == "1":
        print("Одна порція піцци, чудово Ви в якційному списку")

    number = input(" введіть яку к-сть піцц  ви будете брати на Виніс, я запакую :")
    number = int(number)
    if number % 10 == 10:
        print("\n  Супер, вітаю " + str(number) + " так, ви отримали знижку!!!")
    else:
        print(
            "\n От халепа !!!"
            + str(number)
            + " ні, вибачте на рахунку -недостатньо коштів..."
        )

    print(" Гарного Вам дня, чекаємо Вас знову !!!")
